benchmark-results/round-3-intel-full-atillery/smade - 1 - 2.txt
32        Threads
6         Connections per thread
500000    Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets      1507316.04          ---          ---         1.01444         0.97500         1.14300         1.25500         1.60700         1.83100         2.14300         2.30300         2.75100         3.88700     99931.83 
Gets            0.00         0.00         0.00             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---         0.00 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          --- 
Totals    1507316.04         0.00         0.00         1.01444         0.97500         1.14300         1.25500         1.60700         1.83100         2.14300         2.30300         2.75100         3.88700     99931.83 
32        Threads
6         Connections per thread
500000    Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets       149829.96          ---          ---         0.92654         0.88700         1.03900         1.15900         1.43900         1.63100         1.79100         1.88700         2.59100         3.48700      9948.73 
Gets      1498283.16      8219.45   1490063.71         0.92648         0.88700         1.03900         1.15900         1.43900         1.63100         1.79100         1.88700         2.59100         3.48700     60155.77 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          --- 
Totals    1648113.12      8219.45   1490063.71         0.92649         0.88700         1.03900         1.15900         1.43900         1.63100         1.79100         1.88700         2.59100         3.48700     70104.50 
32        Threads
6         Connections per thread
75000     Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets        29828.43          ---          ---         0.58666         0.55100         0.67900         0.76700         0.96700         1.09500         1.23100         1.32700         1.81500         2.44700      1980.58 
Gets       298244.92      1758.47    296486.44         0.58641         0.55100         0.67900         0.76700         0.95900         1.09500         1.22300         1.27100         1.50300         2.59100     11977.01 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          --- 
Totals     328073.35      1758.47    296486.44         0.58643         0.55100         0.67900         0.76700         0.95900         1.09500         1.22300         1.27900         1.51100         2.59100     13957.59 
32        Threads
6         Connections per thread
500000    Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets       135665.85          ---          ---         1.02487         0.98300         1.13500         1.29500         1.63900         1.79100         1.90300         1.97500         2.49500         3.08700      8994.38 
Gets      1356643.58   1356643.58         0.00         1.02484         0.98300         1.13500         1.29500         1.63900         1.79100         1.90300         1.97500         2.49500         3.08700     83318.31 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          --- 
Totals    1492309.43   1356643.58         0.00         1.02484         0.98300         1.13500         1.29500         1.63900         1.79100         1.90300         1.97500         2.49500         3.08700     92312.69 
32        Threads
6         Connections per thread
75000     Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets        28853.10          ---          ---         0.60337         0.57500         0.70300         0.78300         0.98300         1.11900         1.28700         1.39100         2.15900         2.57500      1912.82 
Gets       288492.91    288492.91         0.00         0.60317         0.57500         0.70300         0.78300         0.98300         1.11900         1.27100         1.36700         1.89500         2.41500     17717.68 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          --- 
Totals     317346.01    288492.91         0.00         0.60319         0.57500         0.70300         0.78300         0.98300         1.11900         1.27100         1.37500         1.90300         2.57500     19630.50